#if !defined(_BUTTON_H_)
#define _BUTTON_H_
#include "het_key.h"
/******************************************************************************/
/*
* 函数名称 : button_init
* 功能描述 : button初始化
* 参    数 : 无
* 返回值   : @-1	错误
             @0		正常
* 示    例 : button_init();
*/
/******************************************************************************/
extern int button_init(void);

/******************************************************************************/
/*
* 函数名称 : button_loop
* 功能描述 : 按键定时循环扫描
* 参    数 : 0-无按键 1-短按 2-长按
* 返回值   :无
* 示    例 : button_loop();
*/
/******************************************************************************/
extern int button_loop(void);

#endif // _BUTTON_H_